{"weightsManifest": [{"weights": [{"name": "Output/kernel", "dtype": "float32", "shape": [32, 4]}, {"name": "Output/bias", "dtype": "float32", "shape": [4]}, {"name": "dense/kernel", "dtype": "float32", "shape": [6, 32]}, {"name": "dense/bias", "dtype": "float32", "shape": [32]}, {"name": "dense_1/kernel", "dtype": "float32", "shape": [32, 64]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [64]}, {"name": "dense_2/kernel", "dtype": "float32", "shape": [64, 128]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [128]}, {"name": "dense_3/kernel", "dtype": "float32", "shape": [128, 64]}, {"name": "dense_3/bias", "dtype": "float32", "shape": [64]}, {"name": "dense_4/kernel", "dtype": "float32", "shape": [64, 32]}, {"name": "dense_4/bias", "dtype": "float32", "shape": [32]}], "paths": ["group1-shard1of1"]}], "modelTopology": {"backend": "tensorflow", "keras_version": "2.1.6-tf", "training_config": {"sample_weight_mode": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "epsilon": 1e-07, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "lr": 0.0010000000474974513, "amsgrad": false}}, "loss": "mean_squared_error", "loss_weights": null}, "model_config": {"class_name": "Model", "config": {"name": "model", "output_layers": [["Output", 0, 0]], "layers": [{"inbound_nodes": [], "name": "Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 6], "sparse": false, "name": "Input", "dtype": "float32"}}, {"inbound_nodes": [[["Input", 0, 0, {}]]], "name": "dense", "class_name": "Dense", "config": {"name": "dense", "use_bias": true, "units": 32, "activation": "relu", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["dense", 0, 0, {}]]], "name": "dropout", "class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout", "rate": 0.4, "dtype": "float32"}}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "units": 64, "activation": "relu", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_1", "rate": 0.4, "dtype": "float32"}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "use_bias": true, "units": 128, "activation": "relu", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_2", "rate": 0.4, "dtype": "float32"}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "use_bias": true, "units": 64, "activation": "relu", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dropout_3", "class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_3", "rate": 0.4, "dtype": "float32"}}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "use_bias": true, "units": 32, "activation": "relu", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null}}, {"inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "dropout_4", "class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "name": "dropout_4", "rate": 0.4, "dtype": "float32"}}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "Output", "class_name": "Dense", "config": {"name": "Output", "use_bias": true, "units": 4, "activation": "tanh", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null, "dtype": "float32"}}, "bias_constraint": null, "dtype": "float32", "bias_regularizer": null}}], "input_layers": [["Input", 0, 0]]}}}}