{"modelTopology": {"backend": "tensorflow", "training_config": {"loss_weights": null, "loss": "mean_squared_error", "sample_weight_mode": null, "optimizer_config": {"class_name": "Adam", "config": {"beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "amsgrad": false, "beta_1": 0.8999999761581421, "decay": 0.0, "epsilon": 1e-07}}, "metrics": []}, "keras_version": "2.1.6-tf", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "bias_constraint": null, "batch_input_shape": [null, 6], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activation": "relu", "dtype": "float32", "units": 128, "name": "dense_6", "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activation": "relu", "dtype": "float32", "units": 256, "name": "dense_7", "bias_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activation": "relu", "dtype": "float32", "units": 512, "name": "dense_8", "bias_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activation": "relu", "dtype": "float32", "units": 256, "name": "dense_9", "bias_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activation": "relu", "dtype": "float32", "units": 128, "name": "dense_10", "bias_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "dtype": "float32", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "activation": "tanh", "dtype": "float32", "units": 4, "name": "dense_11", "bias_regularizer": null, "trainable": true}}]}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "dense_10/kernel", "shape": [256, 128]}, {"dtype": "float32", "name": "dense_10/bias", "shape": [128]}, {"dtype": "float32", "name": "dense_11/kernel", "shape": [128, 4]}, {"dtype": "float32", "name": "dense_11/bias", "shape": [4]}, {"dtype": "float32", "name": "dense_6/kernel", "shape": [6, 128]}, {"dtype": "float32", "name": "dense_6/bias", "shape": [128]}, {"dtype": "float32", "name": "dense_7/kernel", "shape": [128, 256]}, {"dtype": "float32", "name": "dense_7/bias", "shape": [256]}, {"dtype": "float32", "name": "dense_8/kernel", "shape": [256, 512]}, {"dtype": "float32", "name": "dense_8/bias", "shape": [512]}, {"dtype": "float32", "name": "dense_9/kernel", "shape": [512, 256]}, {"dtype": "float32", "name": "dense_9/bias", "shape": [256]}]}]}