{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [6, 128], "dtype": "float32", "name": "dense_24/kernel"}, {"shape": [128], "dtype": "float32", "name": "dense_24/bias"}, {"shape": [128, 256], "dtype": "float32", "name": "dense_25/kernel"}, {"shape": [256], "dtype": "float32", "name": "dense_25/bias"}, {"shape": [256, 512], "dtype": "float32", "name": "dense_26/kernel"}, {"shape": [512], "dtype": "float32", "name": "dense_26/bias"}, {"shape": [512, 256], "dtype": "float32", "name": "dense_27/kernel"}, {"shape": [256], "dtype": "float32", "name": "dense_27/bias"}, {"shape": [256, 128], "dtype": "float32", "name": "dense_28/kernel"}, {"shape": [128], "dtype": "float32", "name": "dense_28/bias"}, {"shape": [128, 4], "dtype": "float32", "name": "dense_29/kernel"}, {"shape": [4], "dtype": "float32", "name": "dense_29/bias"}]}], "modelTopology": {"training_config": {"loss_weights": null, "loss": "mean_squared_error", "metrics": [], "weighted_metrics": null, "optimizer_config": {"config": {"decay": 0.0, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "amsgrad": false, "epsilon": 1e-07}, "class_name": "Adam"}, "sample_weight_mode": null}, "keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"config": {"layers": [{"config": {"activation": "relu", "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "batch_input_shape": [null, 6], "units": 128, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "dtype": "float32", "name": "dense_24", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 256, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "dtype": "float32", "name": "dense_25", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 512, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "dtype": "float32", "name": "dense_26", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 256, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "dtype": "float32", "name": "dense_27", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}, {"config": {"activation": "relu", "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 128, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "dtype": "float32", "name": "dense_28", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}, {"config": {"activation": "tanh", "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 4, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "dtype": "float32", "name": "dense_29", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}], "name": "sequential_4"}, "class_name": "Sequential"}}}