{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "Output/kernel", "dtype": "float32", "shape": [32, 4]}, {"name": "Output/bias", "dtype": "float32", "shape": [4]}, {"name": "dense/kernel", "dtype": "float32", "shape": [6, 32]}, {"name": "dense/bias", "dtype": "float32", "shape": [32]}, {"name": "dense_1/kernel", "dtype": "float32", "shape": [32, 64]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [64]}, {"name": "dense_2/kernel", "dtype": "float32", "shape": [64, 128]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [128]}, {"name": "dense_3/kernel", "dtype": "float32", "shape": [128, 64]}, {"name": "dense_3/bias", "dtype": "float32", "shape": [64]}, {"name": "dense_4/kernel", "dtype": "float32", "shape": [64, 32]}, {"name": "dense_4/bias", "dtype": "float32", "shape": [32]}]}], "modelTopology": {"model_config": {"config": {"layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 6], "name": "Input", "dtype": "float32", "sparse": false}, "name": "Input", "class_name": "InputLayer"}, {"inbound_nodes": [[["Input", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "dense", "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "units": 32, "dtype": "float32"}, "name": "dense", "class_name": "Dense"}, {"inbound_nodes": [[["dense", 0, 0, {}]]], "config": {"noise_shape": null, "name": "dropout", "seed": null, "trainable": true, "rate": 0.4, "dtype": "float32"}, "name": "dropout", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "dense_1", "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "units": 64, "dtype": "float32"}, "name": "dense_1", "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.4, "dtype": "float32"}, "name": "dropout_1", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "dense_2", "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "units": 128, "dtype": "float32"}, "name": "dense_2", "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true, "rate": 0.4, "dtype": "float32"}, "name": "dropout_2", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "dense_3", "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "units": 64, "dtype": "float32"}, "name": "dense_3", "class_name": "Dense"}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"noise_shape": null, "name": "dropout_3", "seed": null, "trainable": true, "rate": 0.4, "dtype": "float32"}, "name": "dropout_3", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "dense_4", "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "units": 32, "dtype": "float32"}, "name": "dense_4", "class_name": "Dense"}, {"inbound_nodes": [[["dense_4", 0, 0, {}]]], "config": {"noise_shape": null, "name": "dropout_4", "seed": null, "trainable": true, "rate": 0.4, "dtype": "float32"}, "name": "dropout_4", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"kernel_regularizer": null, "name": "Output", "activation": "tanh", "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "dtype": "float32", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "trainable": true, "units": 4, "dtype": "float32"}, "name": "Output", "class_name": "Dense"}], "name": "model", "input_layers": [["Input", 0, 0]], "output_layers": [["Output", 0, 0]]}, "class_name": "Model"}, "keras_version": "2.1.6-tf", "training_config": {"loss": "mean_squared_error", "sample_weight_mode": null, "metrics": ["accuracy"], "optimizer_config": {"config": {"amsgrad": false, "epsilon": 1e-07, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "decay": 0.0}, "class_name": "Adam"}, "loss_weights": null}, "backend": "tensorflow"}}